/*для підрахунку площі фігури, що фактично складається
з двох рівних прямокутників, перетином яких є квадрат,
підрахуємо їх площі та віднімемо площу цього квадрату, що лежить на їх перетині.
вхідними даними мають бути дійсні числа, більші за 0.*/
#include <iostream>
using namespace std;
int main()
{
    int a, b;
    cout << "Введіть значення більшої довжини a(довжина_1):\n";
    cin >> a;
    cout << "Введіть значення меншої довжини b(довжина_2):\n";
    cin >> b;
    if (a <= 0 or b <=0 or a<=b) {
        cout << "Неможливо підрахувати площу: несумісне значення сторін фігури\n";
    } else {
        int square = 2*a*b - b*b;
        cout << "Площа фігури зі вказаними сторонами дорівнює " << square <<endl;
    }
    return 0;
}
