""" для підрахунку площі фігури, що фактично складається
з двох рівних прямокутників, перетином яких є квадрат, підрахуємо їх площі та віднімемо площу цього квадрату,
 що лежить на їх перетині.
 вхідними даними мають бути дійсні числа, більші за 0.
"""
import math

a = int(input("Введіть значення більшої довжини a(довжина_1):\n"))
b = int(input("Введіть значення меншої довжини b(довжина_2):\n"))
if a==0 or b==0 or a<=b:
    print("Неможливо підрахувати площу: несумісне значення сторін фігури\n")
else:
    cross_square = 2*a*b - b*b
    print("Площа фігури зі вказаними сторонами дорівнює " + str(cross_square))



